app/controllers/home_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'saffsf@jidjiod.com' LIMIT 1
---
  def verify
    user = User.find_by email: params[:email]

INSERT INTO "users" ("created_at", "email", "password", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 12 Aug 2013 06:59:16 UTC +00:00], ["email", "brooksmason@gmail.com"], ["password", "hsdaidsojo"], ["updated_at", Mon, 12 Aug 2013 06:59:16 UTC +00:00]]
---
  def register
    user = User.create(email: params[:email], password: params[:password])